Repository: semiautomaticgit/SemiAutomaticClassificationManual
Catalog: locale/*/LC_MESSAGES/accuracy_tab.po
Languages: tr

source: Accuracy
tr: doğruluk

source: registry_save
tr: kayıt_kaydet

source: project_save
tr: proje_kaydetme

source: optional
tr: isteğe bağlı

source: input_list
tr: liste_giriş

source: input_text
tr: metin_girişi

source: input_date
tr: tarih_giriş

source: input_number
tr: numara_giriş

source: input_table
tr: tablo_giriş

source: open_file
tr: dosyayı_aç

source: new_file
tr: yeni_dosya

source: add
tr: ekle

source: reset
tr: Sıfırla

source: bandset_tool
tr: bandset_araçları

source: download
tr: indir

source: export
tr: dışa aktar

source: tools
tr: araçlar

source: preprocessing
tr: ön_işleme

source: band_processing
tr: bant_işleme

source: postprocessing
tr: son_işlem

source: bandcalc
tr: bant hesaplama

source: settings
tr: ayarlar

source: script_tool
tr: komut dosyası araçları

source: enter
tr: giriş

source: zoom_to_ROI
tr: ROI ye yaklaş

source: check
tr: onay

source: select_all
tr: tümünü seç

source: guide
tr: rehber

source: help
tr: yardım

source: reload
tr: yeniden yükle

source: checkbox
tr: onay kutusu

source: run
tr: yürüt

source: radiobutton
tr: radyo buton

source: pointer
tr: işaretçi

source: threshold_tool
tr: eşik_aracı

source: Classification is compared to a reference raster or reference vector (which is automatically converted to raster). If a vector is selected as reference, it is possible to choose a field describing class values.
tr: Sınıflandırma bir referans raster veya referans vektör (otomatik olarak rastere dönüştürülür) ile karşılaştırılır. Referans olarak bir vektör seçilirse, sınıf değerlerini tanımlayan bir alan seçmek mümkündür.

source: Several statistics are calculated such as overall accuracy, user's accuracy, producer's accuracy, and Kappa hat. In particular, these statistics are calculated according to the area based error matrix where each element represents the estimated area proportion of each class. This allows for estimating the unbiased user's accuracy and producer's accuracy, the unbiased area of classes according to reference data, and the standard error of area estimates.
tr: Genel doğruluk, kullanıcı doğruluğu, üretici doğruluğu ve Kappa şapkası gibi çeşitli istatistikler hesaplanır. Özellikle bu istatistikler, her bir elemanın her bir sınıfın tahmini alan oranını temsil ettiği alan tabanlı hata matrisine göre hesaplanır. Bu, tarafsız kullanıcı doğruluğu ve üretici doğruluğunun, referans verilere göre sınıfların tarafsız alanının ve alan tahminlerinin standart hatasının tahmin edilmesini sağlar.

source: The output is an ``error raster`` that is a ``.tif`` file showing the errors in the map, where pixel values represent the categories of comparison (i.e. combinations identified by the ``ErrorMatrixCode`` in the error matrix) between the classification and reference. Also, a text file containing the error matrix (i.e. a ``.csv`` file separated by tab) is created with the same name defined for the ``.tif`` file.
tr: Çıktı, piksel değerlerinin sınıflandırma ve referans arasındaki karşılaştırma kategorilerini (yani hata matrisindeki ``ErrorMatrixCode`` ile tanımlanan kombinasyonlar) temsil ettiği, haritadaki hataları gösteren bir ``.tif`` dosyası olan bir ``error raster``dır. Ayrıca, hata matrisini içeren bir metin dosyası (yani tab ile ayrılmış bir ``.csv`` dosyası) ``.tif`` dosyası için tanımlanan aynı adla oluşturulur.

source: This tool supports ``virtual raster output``; if the output file name ends with ``.vrt`` then the output is created as virtual raster composed of as many ``.tif`` files as the number of CPU threads defined in :ref:`system_processing`; for large rasters this can speed up the process.
tr: Bu araç ``sanal raster çıktısını`` destekler; çıktı dosyası adı ``.vrt`` ile bitiyorsa, çıktı :ref:`system_processing` içinde tanımlanan CPU iş parçacığı sayısı kadar ``.tif`` dosyasından oluşan sanal raster olarak oluşturulur; büyük rasterler için bu işlemi hızlandırabilir.

source: Information about APIs of this tool in Remotior Sensus at this `link <https://remotior-sensus.readthedocs.io/en/latest/remotior_sensus.tools.cross_classification.html>`_ .
tr: Remotior Sensus'taki bu aracın API'leri hakkında bilgi bu `link <https://remotior-sensus.readthedocs.io/en/latest/remotior_sensus.tools.cross_classification.html>`_ adresinde.

source: Tool symbol and name
tr: Alet sembolü ve adı

source: Description
tr: Açıklama

source: :guilabel:`Select the classification to assess` |input_list|
tr: :guilabel:`Değerlendirilecek sınıflandırmayı seçin` |input_list|

source: select a classification raster (already loaded in QGIS)
tr: bir sınıflandırma rasterı seçin (QGIS'te zaten yüklü)

source: |reload|
tr: |yeniden yükle|

source: refresh layer list
tr: katman listesini yenile

source: :guilabel:`Select the reference vector or raster` |input_list|
tr: :guilabel:`Referans vektörünü veya rasterini seçin` |input_list|

source: select a raster or a vector (already loaded in QGIS), used as reference layer (ground truth) for the accuracy assessment
tr: doğruluk değerlendirmesi için referans katmanı (zemin gerçeği) olarak kullanılan bir raster veya vektör (QGIS'te zaten yüklü) seçin

source: :guilabel:`Vector field` |input_list| |optional|
tr: :guilabel:`Vektör alanı` |input_list| |optional|

source: if a vector is selected as reference, select a vector field containing numeric class values
tr: referans olarak bir vektör seçilirse, sayısal sınıf değerlerini içeren bir vektör alanı seçin

source: |checkbox| :guilabel:`Use value as NoData` |input_number| |optional|
tr: |checkbox| :guilabel:`Değeri NoData olarak kullan` |input_number| |optional|

source: if checked, set the value of ``NoData`` pixels, ignored during the calculation
tr: işaretliyse, hesaplama sırasında yok sayılan ``Veri Yok`` piksellerinin değerini ayarlar
