Repository: semiautomaticgit/SemiAutomaticClassificationManual
Catalog: locale/*/LC_MESSAGES/band_erosion_tab.po
Languages: id_id

source: Erosion
id_id: Erosi

source: optional
id_id: Pilihan

source: input_list
id_id: Masukkan daftar

source: input_text
id_id: Masukkan teks

source: input_date
id_id: Masukkan tanggal

source: input_number
id_id: Masukkan Angka

source: input_table
id_id: Masukkan tabel

source: open_file
id_id: Buka

source: new_file
id_id: Baru

source: add
id_id: Tambah

source: reset
id_id: Atur Ulang

source: download
id_id: Unduh

source: export
id_id: Ekspor

source: tools
id_id: Alat

source: settings
id_id: Pengaturan

source: check
id_id: Cek

source: select_all
id_id: pilih semua

source: add_sign_tool
id_id: tambah sarana tanda tangan

source: guide
id_id: Petunjuk

source: help
id_id: Bantuan

source: reload
id_id: muat ulang

source: run
id_id: jalankan

source: pointer
id_id: penunjuk

source: :guilabel:`Erosion`
id_id: :guilabel:`Erosi`

source: This tab allows for removing the border of a class patch (erosion), defining the class values to be eroded and the number of pixels from the border. It is useful for classification refinement.
id_id: Tab ini memungkinkan untuk menghapus batas dari sebuah potongan kelas (erosi), menjelaskan nilai kelas yang perlu dikurangi dan jumlah pixel dari batas. Ini berguna untuk menyempurnakan klasifikasi

source: Information about APIs of this tool in Remotior Sensus at this `link <https://remotior-sensus.readthedocs.io/en/latest/remotior_sensus.tools.band_erosion.html>`_ .
id_id: Informasi tentang API alat ini ada di Remotior Sensus pada tautan `link <https://remotior-sensus.readthedocs.io/en/latest/remotior_sensus.tools.band_erosion.html>`_ .v

source: Tool symbol and name
id_id: Nama dan simbol alat

source: Description
id_id: Deskripsi

source: :guilabel:`Select input band set (of classifications)` |input_number|
id_id: :guilabel:`Pilih sekumpulan band masukan (klasifikasi)` |input_number|

source: select the input :ref:`band_set_tab`
id_id: pilih masukan :ref:`band_set_tab`

source: :guilabel:`Class values` |input_text|
id_id: :guilabel:`Nilai kelas` |input_text|

source: set the class values to be dilated; class values must be separated by ``,`` and ``-`` can be used to define a range of values (e.g. ``1, 3-5, 8`` will select classes 1, 3, 4, 5, 8); if the text is red then the expression contains errors
id_id: tentukan nilai kelas untuk ditambahkan; nilai kelas harus dipisahkan dengan "," dan "-" dapat digunakan untuk mendefinisikan rentang nilai (contoh: "1, 3-5, 8" akan memilih kelas 1, 3, 4, 5, 8); jika text berwarna merah maka ada kesalahan dalam rumus yang digunakan

source: :guilabel:`Size in pixels` |input_number|
id_id: :guilabel:`Ukuran dalam pixel` |input_number|

source: number of pixels to be dilated from the border
id_id: jumlah pixel yang akan ditambahkan dari batas

source: |checkbox| :guilabel:`Circular` |optional|
id_id: |checkbox| :guilabel:`Melingkar` |optional|

source: if checked, the erosion will be circular, similar to a buffer
id_id: jika dicentang, erosinya akan berbentuk melingkar seperti buffer

source: :guilabel:`Output name`
id_id: :guilabel:`Nama keluaran`

source: set the name prefix for output files
id_id: tentukan awalan nama untuk file keluaran

source: |checkbox| :guilabel:`Virtual output` |optional|
id_id: |checkbox| :guilabel:`Keluaran virtual` |optional|

source: if checked, the output is created as virtual raster composed of as many ``.tif`` files as the number of CPU threads defined in :ref:`system_processing`
id_id: jika dicentang, keluaran dihasilkan sebagai raster virtual yang terdiri dari file ".tif" sejumlah unit CPU yang didefinisikan didalam: ref:' system_processing'

source: add this function to the :ref:`script_tab`
id_id: tambahkan fungsi ini ke :ref:'script_tab'

source: :guilabel:`RUN` |run|
id_id: :guilabel:`JALANKAN` |run|

source: run this function
id_id: jalankan fungsi ini
