Repository: semiautomaticgit/SemiAutomaticClassificationManual
Catalog: locale/*/LC_MESSAGES/band_calc_tab.po
Languages: es_419

source: Band calc
es_419: Calculadora de Bandas

source: registry_save
es_419: registro_guardar

source: project_save
es_419: guardar_proyecto

source: optional
es_419: opcional

source: input_list
es_419: lista_entrada

source: input_text
es_419: texto de entrada

source: input_date
es_419: fecha_entrada

source: input_number
es_419: número de entrada

source: input_slider
es_419: deslizante_entrada

source: input_table
es_419: tabla_entrada

source: add
es_419: agregar

source: checkbox
es_419: casilla de confirmación

source: pointer
es_419: puntero

source: radiobutton
es_419: botón de radio

source: reload
es_419: recargar

source: reset
es_419: reiniciar

source: remove
es_419: quitar

source: run
es_419: ejecutar

source: open_file
es_419: abrir archivo

source: new_file
es_419: nuevo archivo

source: open_dir
es_419: abrir_dir

source: move_up
es_419: mover_arriba

source: move_down
es_419: mover_abajo

source: import
es_419: importar

source: export
es_419: exportar

source: bandcalc_tool
es_419: herramienta_calcband

source: bandset_tool
es_419: Herramienta de conjunto de bandas

source: settings_tool
es_419: herramienta_configuracion

source: :guilabel:`Band calc`
es_419: :guilabel:`Calculadora de Bandas`

source: The ``Band calc`` allows for the **raster calculation for bands** (i.e. calculation of pixel values) using `NumPy functions <https://numpy.org/doc/stable/reference/routines.math.html>`_. ``Band calc`` can also work with multiple expression lines to perform multiple calculation at a time; several iteration functions are available for :guilabel:`Band sets` allowing for performing multi-temporal calculations.
es_419: La ``Calculadora de Bandas`` permite hacer **cálculos raster con bandas** (i.e. cálculos con los valores de los píxeles) usando `funciones de NumPy <https://numpy.org/doc/stable/reference/routines.math.html>`_. ``Calculadora de Bandas`` puede trabajar con expresiones con varias líneas de expresiones para realizar multiples cálculos de una sola vez; varias funciones para iteraciones están disponibles para guilabel:`Conjuntos de bandas` lo que permite realizar cálculos multi-temporales.

source: This tool supports ``virtual raster output``; if the output file name ends with ``.vrt`` then the output is created as virtual raster composed of as many ``.tif`` files as the number of CPU threads defined in :ref:`system_processing`; for large rasters this can speed up the process.
es_419: Esta herramienta admite ''salida ráster virtual''; si el nombre del archivo de salida termina con ''.vrt'', la salida se crea como ráster virtual compuesto por varios archivos ''.tif'' como el número de subprocesos de CPU definidos en :ref:'system_processing'; para rásteres grandes, esto puede acelerar el proceso.

source: Raster bands must be already loaded in QGIS. Input rasters can also be in different projection, but the output will have the projection of the reference raster.
es_419: Las bandas ráster tienen que estar ya cargadas en QGIS. Los rásters de entrada pueden estar en proyecciones diferentes, pero la salida tendrá la proyección del ráster de referencia.

source: Information about APIs of this tool in Remotior Sensus at this `link <https://remotior-sensus.readthedocs.io/en/latest/remotior_sensus.tools.band_calc.html>`_ .
es_419: Información sobre las APIs de esta herramienta de Remotior Sensus en este `enlace<https://remotior-sensus.readthedocs.io/en/latest/remotior_sensus.tools.band_calc.html>`_ .

source: Band list
es_419: Lista de Bandas

source: Tool symbol and name
es_419: Símbolo de la herramienta y nombre

source: Description
es_419: Descripción

source: |input_table| :guilabel:`Band list`
es_419: |input_table| :guilabel:`Lista de bandas`

source: table containing a list of single band rasters (already loaded in QGIS) and :ref:`input_variables` defined from :guilabel:`Band set`
es_419: tabla que contiene una lista de rásteres mono banda (ya cargados en QGIS) y :ref:`input_variables` definidas desde el :guilabel:`Conjunto de bandas`

source: :guilabel:`Filter` |input_text|
es_419: :guilabel:`Filtro` |input_text|

source: filter the variable list
es_419: filtra la lista de variables

source: |reload|
es_419: |recarga|

source: refresh band list
es_419: actualiza la lista de bandas

source: Expression
es_419: Expresión

source: Enter a mathematical expression for raster bands. In particular, NumPy functions can be used with the prefix `np.` (e.g. ``np.log10(raster1)`` ). For a list of NumPy functions see `the NumPy page <https://numpy.org/doc/stable/reference/routines.math.html>`_ .
es_419: Introduzca una expresión matemática para bandas ráster. En particular, las funciones NumPy se pueden utilizar con el prefijo 'np.' (por ejemplo, ''np.log10(raster1)''). Para obtener una lista de las funciones de NumPy, consulte 'la página de NumPy <https://numpy.org/doc/stable/reference/routines.math.html>`_ .

source: The expression can work with :guilabel:`Variable` between ``"``. Double click on any item in the :ref:`band_list2` for adding the name thereof to the expression.
es_419: La expresión puede funcionar con :guilabel:`Variable` entre ``"``. Haz doble click en cualquier elemento de la :ref:`band_list2` para añadir el nombre de la misma a la expresión.

source: If text color in the :guilabel:`Expression` is green, then the syntax is correct; if text color is red, then the syntax is incorrect and it is not possible to execute the calculation.
es_419: Si el color del texto en :guilabel:'Expression' es verde, entonces la sintaxis es correcta; si el color del texto es rojo, la sintaxis es incorrecta y no es posible ejecutar el cálculo.

source: It is possible to enter multiple expressions separated by newlines such as the following example::
es_419: Es posible introducir varias expresiones separadas por nuevas líneas como el siguiente ejemplo::

source: The above example calculates two new rasters in the output directory with the suffix ``_1`` (e.g. ``calc_raster_1`` ) for the first expression and ``_2`` (e.g. ``calc_raster_2`` ) for the second expression. Also, it is possible to define the output name using the symbol ``@`` followed by the name, such as the following example::
es_419: El ejemplo anterior calcula dos nuevos rásteres en el directorio de salida con el sufijo ''_1'' (por ejemplo, ''calc_raster_1'') para la primera expresión y ''_2'' (por ejemplo, ''calc_raster_2'') para la segunda expresión. Además, es posible definir el nombre de salida utilizando el símbolo ''@'' seguido del nombre, como el siguiente ejemplo:

source: :ref:`input_variables` and :ref:`output_variables` can be used in the expression.
es_419: :ref:`input_variables` y :ref:`output_variables` pueden ser usadas en la expresión.

source: |checkbox| :guilabel:`Input NoData as value` |optional|
es_419: |checkbox| :guilabel:`Valor Sin Datos de entrada` |optional|

source: if checked, input ``NoData`` pixels are replaced by ``NoData`` value and accounted in calculation
es_419: si está marcado, el valor ``Sin datos`` de la entrada será reemplazado por el valor definido `Sin datos`` y será tenido en cuenta en los cálculos

source: |checkbox| :guilabel:`Use value as NoData` |input_number| |optional|
es_419: |checkbox| :guilabel:`Usar el valor como valor Sin Datos` |input_number| |optional|

source: if checked, selected value is used as ``NoData`` during calculation
es_419: si está marcado el valor será usado como ``Sin datos`` durante los cálculos

source: :guilabel:`Calculation data type`
es_419: :guilabel:`Tipo de datos de los cálculos`

source: select the data type used during calculation as Float32 (default), Int32, Int16, UInt32, UInt16, Byte; for instance, if Int32 is selected, input float values will be evaluated as integer
es_419: selecciona el tipo de datos a usar durante los cálculos como Float32 (default), Int32, Int16, UInt32, UInt16, Byte; por ejemplo, si seleccionas Int32, los valores flotantes de la entrada serán evaluados como enteros

source: |input_table| :guilabel:`Functions`
es_419: |input_table| :guilabel:`Funciones`

source: list of :ref:`band_calc_function` names (double click to copy one in the expression) such as mathematical, conditional, logical, statistics, indices, and custom
es_419: lista con los nombres de las :ref:`band_calc_function` (haz doble click para copiar una en la expresión) tales como matemáticas, condicionales, lógicas, estadísticas, indices, y personalizadas

source: open a text file (.txt) containing custom expressions to be listed in :guilabel:`Functions`
es_419: abre un archivo de texto (.txt) que contenga expresiones personalizadas para que sean listadas en :guilabel:`Funciones`

source: A text file can be loaded for adding expressions to the :guilabel:`Functions`. The text must contain an expression for each line; each line must be in the form ``expression_name; expression`` (separated by ``;``) where the ``expression_name`` is the expression name that is displayed in the :guilabel:`Functions`. Opening an empty text file will remove custom expressions from the :guilabel:`Functions`. Following an example of text content::
es_419: Se puede cargar un archivo de texto para añadir las expresiones a la lista de :guilabel:`Funciones`. El archivo debe contener expresiones, cada una escrita en una línea, con el siguiente formato ``nombre_expresion; expresión`` (separado por ``;``) donde ``nombre_expresion`` es el nombre que se mostrará en la lista de :guilabel:`Funciones`. Abrir un archivo de texto vacío quitará las expresión de la lista de :guilabel:`Funciones`. A continuación se muestra un ejemplo de texto:

source: Output raster
es_419: Ráster de salida

source: The output raster is a .tif file, with the same spatial resolution and projection of input rasters; if input rasters have different spatial resolutions, then the highest resolution (i.e. minimum pixel size) is used for output raster.
es_419: El ráster de salida es un archivo .tif, con la misma resolución espacial y proyección que el ráster de entrada; si los ráster de entrada tienen diferente resolución espacial, se usará la mayor resolución (i.e. menor tamaño de pixel) para el ráster de salida.

source: If multiple lines are entered in Expression or output name are defined in line, a directory selection instead of a file selection is prompted for output.
es_419: si se introducen varias líneas en una expresión o varios nombres de salida son definidos en línea, se mostrará un diálogo de selección de directorio en lugar de uno para archivos

source: :guilabel:`Output data type` |input_list|
es_419: :guilabel:`Tipo de dato de salida` |input_list|

source: select the output data type as Float32 (default), Int32, Int16, UInt32, UInt16, Byte; it can be different from :guilabel:`Calculation data type`
es_419: selecciona el tipo de dato de salida como Float32 (por defecto), Int32, Int16, UInt32, UInt16, Byte; puede ser diferente del :guilabel:`Tipo de datos de los cálculos`

source: :guilabel:`Output NoData value` |input_number|
es_419: :guilabel:`Valor sin datos de la salida` |input_number|

source: set the value of ``NoData`` pixels in output raster
es_419: define el valor de los píxeles `Sin datos`` en el ráster de salida

source: :guilabel:`NoData mask` |input_list|
es_419: :guilabel:`Máscara Sin Datos` |input_list|

source: manage NoData at pixel level; if True, then output is NoData if any input is NoData; if False, then output is NoData if all the inputs are NoData; if None, then NoData is not applied to output
es_419: gestiona los valores Sin Datos a nivel pixel, si es True, entonces el resultado es Sin datos si alguna entrada es Sin Datos.; si es False, entonces el resultado es Sin Datos si todas las entradas son Sin Datos; si es None, entonces los valores Sin Datos no son aplicados a la salida

source: |checkbox| :guilabel:`Set scale` |input_number| |optional|
es_419: |checkbox| :guilabel:`Definir escala` |input_number| |optional|

source: if checked, set a scale in output raster (and output values are divided by scale)
es_419: si está marcado, define un escalado en el ráster de salida (y los valores de salida será divididos por la escala).

source: |checkbox| :guilabel:`Set offset` |input_number| |optional|
es_419: |checkbox| :guilabel:`Definir compensación` |input_number| |optional|

source: if checked, set an offset in output raster (and offset is subtracted to output values)
es_419: si está marcado, define una compensación (offset) en el ráster de salida (y la compensación es restada a los valores de salida).

source: :guilabel:`Extent` |input_list| :guilabel:`UL X` :guilabel:`UL Y` :guilabel:`LR X` :guilabel:`LR Y`
es_419: :guilabel:`Extensión` |input_list| :guilabel:`UL X` :guilabel:`UL Y` :guilabel:`LR X` :guilabel:`LR Y`

source: set the extent of the output raster among:
es_419: define la extensión del ráster de salida entre:

source: :guilabel:`'Union'`: the extent union of input rasters
es_419: :guilabel:`'Unión'`: la extensión de los rásteres de entrada unidos

source: :guilabel:`'Map extent'`: the extent of the map currently displayed
es_419: :guilabel:`'Extensión del mapa'`: extensión del mapa que se está siendo mostrado actualmente

source: :guilabel:`'Intersection'`: the extent intersection of input raster extents (i.e. minimum extent)
es_419: :guilabel:`'Intersección'`: la extensión de la intersección de los rásteres de entrada (i.e. extensión mínina)

source: :guilabel:`'Custom'`: coordinates defined in :guilabel:`UL X` :guilabel:`UL Y` :guilabel:`LR X` :guilabel:`LR Y`
es_419: :guilabel:`'Personalizada'`: coordenadas definidas en :guilabel:`X SI` :guilabel:`Y SI` :guilabel:`X ID` :guilabel:`Y ID`

source: :guilabel:`Layer name`: the extent of the selected layer
es_419: :guilabel:`Nombre de la capa`: extensión de la capa seleccionada

source: :guilabel:`Align` |input_list|
es_419: :guilabel:`Alinear` |input_list|

source: align the output raster to a specific :guilabel:`Layer name` or :guilabel:`'Default'` for automatic alignment to input rasters
es_419: alinear el ráster de salida a :guilabel:`Nombre de capa` or :guilabel:`'Por defecto'` para alinear automáticamente a los rásteres de entrada.

source: :guilabel:`Pixel size` |input_text|
es_419: :guilabel:`Tamaño de píxel` |input_text|

source: set pixel size
es_419: define el tamaño de píxel

source: :guilabel:`RUN` |run|
es_419: :guilabel:`EJECUTAR` |run|

source: run this function; it is disabled if the expression syntax is not correct
es_419: ejecutar esta función; está desactivado si la sintaxis de la expresión no es correcta

source: Input variables
es_419: Variables de entrada

source: The following variables related to the :ref:`band_set_tab` are available (please note that the character ``"`` is always required):
es_419: La siguientes variables relacionadas al :ref:`band_set_tab` están disponibles (nótese que siempre se requiere el carácter ``"``)

source: :guilabel:`bandset#b` `BAND_NUMBER`: bands in the active :guilabel:`Band set` can be referenced directly; the following example refers to band 1 of the active :guilabel:`Band set`::
es_419: :guilabel:`bandset#b` `BAND_NUMBER`: bandas en el :guilabel:`Band set` activo pueden ser referenciadas directamente; el siguiente ejemplo se refiere la banda uno del :guilabel:`Conjunto de bandas` activo:

source: :guilabel:`bandset` `BANDSET_NUMBER` ``b`` `BAND_NUMBER`: bands in the :guilabel:`Band set` can be referenced directly; the following example refers to band 1 of the :guilabel:`Band set` 1::
es_419: :guilabel:`bandset` `BANDSET_NUMBER` ``b`` `BAND_NUMBER`: bandas en el :guilabel:`Conjunto de bandas` pueden ser referenciadas directamente; el siguiente ejemplo hace referencia a la banda 1 del :guilabel:`Conjunto de bandas` 1::

source: :guilabel:`bandset{` `BANDSET_NUMBER_LIST` ``}b`` `BAND_NUMBER`: list of all the bands X of all the :guilabel:`Band sets` matching a list between curly brackets (e.g. {1,2,3}) or range of :guilabel:`Band sets` separated by colon (e.g. {1:3}) or a list of ranges of :guilabel:`Band sets` (e.g. {1:3, 5:8}), which is equivalent to ``[bandset1bX, bandset2bX, ..., bandsetNbX]``; this variable can be used in expressions that accept band lists such as the sum::
es_419: :guilabel:`bandset{` `BANDSET_NUMBER_LIST` ``}b`` `BAND_NUMBER`: lista con todas las bandas X de todos los :guilabel:`Conjuntos de bandas` coincidentes con una lista entre corchetes (e.g. {1,2,3}) o rango de :guilabel:`Conjunto de bandas` separados por dos puntos (e.g. {1:3}) o una lista de rangos de :guilabel:`Conjuntos de bandas` (e.g. {1:3, 5:8}), que es equivalente a ``[bandset1bX, bandset2bX, ..., bandsetNbX]``; esta variable puede ser usada en expresiones que acepten listas de bandas tales como la suma::

source: :guilabel:`bandset#b*`: list of all the bands of active :guilabel:`Band set`, which is equivalent to ``[bandset#b1, bandset#b2, ..., bandset#bX]``; to be used in expressions that accept band lists such as the maximum value::
es_419: :guilabel:`bandset#b*`: lista de todas las bandas de un :guilabel:`Conjunto de bandas` activo, que es equivalente a ``[conjuntobandas#b1, conjuntobandas#b2, ..., conjuntobandas#bX]``; y se pueden usar en expresiones que aceptan listas de bandas tales como el valor máximo::

source: :guilabel:`bandset` `BANDSET_NUMBER` ``b*``: list of all the bands of :guilabel:`Band set` N, which is equivalent to ``[bandsetNb1, bandsetNb2, ..., bandsetNbX]``; to be used in expressions that accept band lists such as the minimum value::
es_419: :guilabel:`bandset` `BANDSET_NUMBER` ``b*``: lista de todas las bandas de un :guilabel:`Conjunto de bandas` N, que es equivalente a ``[bandsetNb1, bandsetNb2, ..., bandsetNbX]``; y puede ser usando en expresiones que acepten listas de bandas tales como el valor mínimo::

source: :guilabel:`bandset*b` `BAND_NUMBER`: list of all the bands X of all the :guilabel:`Band sets`, which is equivalent to ``[bandset1bX, bandset2bX, ..., bandsetNbX]``; to be used in expressions that accept band lists such as the mean value::
es_419: :guilabel:`bandset*b` `BAND_NUMBER`: lista de todas las bandas X de un :guilabel:`Conjunto de bandas`, que es equivalente a ``[conjuntobandas1bX, conjuntobandas2bX, ..., conjuntobandasNbX]``; y se puede ser usado en expresiones que aceptan listas de bandas tales como el valor medio::

source: :guilabel:`bandset{` `DATE` ``}b`` `BAND_NUMBER`: list of all the bands X of all the :guilabel:`Band sets` matching a list of dates (format yyyy-mm-dd) between curly brackets (e.g. {2019-01-01,2019-07-31}) or range of dates separated by colon (e.g. {2019-01-01:2019-07-31}) or a list of ranges of dates (e.g. {2019-01-01:2019-01-31, 2019-04-01:2019-07-31}), which is equivalent to ``[bandset2bX, bandset5bX, ..., bandsetNbX]``; :guilabel:`Band sets` dates are defined in :ref:`band_set_definition`; this variable can be used in expressions that accept band lists such as the median value::
es_419: :guilabel:`bandset{` `DATE` ``}b`` `BAND_NUMBER`: lista de todas las bandas de un :guilabel:`Conjunto de bandas` coincidente con una lista de fechas (format yyyy-mm-dd) entre corchetes (e.g. {2019-01-01,2019-07-31}) o un rango de fechas separados por dos puntos (e.g. {2019-01-01:2019-07-31}) o una lista de rangos de fechas (e.g. {2019-01-01:2019-01-31, 2019-04-01:2019-07-31}), que es equivalente a ``[conjuntobandas2bX, conjuntobandas5bX, ..., conjuntobandasNbX]``; las fechas de un :guilabel:`Conjunto de bandas` están definidas en :ref:`band_set_definition`; esta variable puede ser usada en expresiones que aceptan listas de bandas tales como el valor medio::

source: :guilabel:`"#BLUE#"`: the band with the center wavelength closest to 0.475 :math:`\mu m`;
es_419: :guilabel:`"#BLUE#"`: la banda con el centro de longitud de onda cercano a 0.475 :math:`\mu m`;

source: :guilabel:`"#GREEN#"`: the band with the center wavelength closest to 0.56 :math:`\mu m`;
es_419: :guilabel:`"#VERDE#"`: la banda con el centro de longitud de onda cercano a 0.56 :math:`\mu m`;

source: :guilabel:`"#RED#"`: the band with the center wavelength closest to 0.65 :math:`\mu m`;
es_419: :guilabel:`"#RED#"`: la banda con el centro de longitud de onda cercano a 0.65 :math:`\mu m`;

source: :guilabel:`"#NIR#"`: the band with the center wavelength closest to 0.85 :math:`\mu m`; for example::
es_419: :guilabel:`"#IRC#"`: la banda con el centro de longitud de onda cercano a 0.85 :math:`\mu m`;

source: Output variables
es_419: Variables de salida

source: **Output names** can be defined in the expression line entering the symbol ``@`` followed by the name, such as the following example::
es_419: Los **nombres de las variables de salida** pueden definirse en la línea de la expresión con el símbolo ``@`` seguido del nombre, como en el siguiente ejemplo::

source: If the output name is defined in the expression, an output directory will be selected after clicking the button :guilabel:`RUN`.
es_419: Si el nombre del resultado está definido en la expresión, habrá que seleccionar el directorio de salida después de hacer click en el botón :guilabel:`EJECUTAR`.

source: It is recommended to avoid the use of characters # and @ in the output raster name.
es_419: Se recomienda no usar los caracteres # y @ en el nombre del ráster de salida.

source: It is possible to set the **output path** directly by defining the output name with this structure ``@path@name``, such as::
es_419: es posible definir la **ruta de salida** en el nombre del resultado usando la siguiente estructura ``@path@name`` en una expresión, tal como::

source: The directory will be created if it does not exist.
es_419: El directorio será creado si no existe.

source: :guilabel:`#BANDSET#`: the name of the first band in the :ref:`band_set_tab`;
es_419: :guilabel:`#BANDSET#`: el nombre de la primera banda en el:ref:`band_set_tab`;

source: :guilabel:`#DATE#`: the current date and time (e.g. 20161110_113846527764);
es_419: :guilabel:`#DATE#`: la fecha y hora actuales(e.g. 20161110_113846527764);

source: Functions
es_419: Funciones

source: :guilabel:`cos`: cosine;
es_419: :guilabel:`cos`: coseno;

source: :guilabel:`tan`: tangent;
es_419: :guilabel:`tan`: tangente;

source: :guilabel:`asin`: inverse sine;
es_419: :guilabel:`asin`: seno inverso;

source: :guilabel:`acos`: inverse cosine;
es_419: :guilabel:`acos`: coseno inverso;

source: :guilabel:`atan`: inverse tangent;
es_419: :guilabel:`atan`: tangente inversa;

source: :guilabel:`exp`: natural exponential;
es_419: :guilabel:`exp`: exponencial natural;

source: :guilabel:`ln`: natural logarithm;
es_419: :guilabel:`ln`: logaritmo natural;
