Repository: semiautomaticgit/SemiAutomaticClassificationManual
Catalog: locale/*/LC_MESSAGES/classification_tab.po
Languages: es_419

source: Classification
es_419: Classificación

source: :guilabel:`Classification`
es_419: :guilabel:`Clasificación`

source: This tab allows for the classification of the :ref:`band_set_tab` using the spectral signatures checked in :ref:`ROI_list`. Several classification options are set in this tab which affect the classification process also during the :ref:`classification_preview`.
es_419: Esta pestaña permite la clasificación de: ref: `band_set_tab` usando las firmas espectrales registradas: ref:` ROI_list`. Varias opciones de clasificación se establecen en esta pestaña que afectan el proceso de clasificación también durante la: ref: `class_preview`.

source: This tool allows for the selection of one the following algorithms:
es_419: Esta herramienta permite seleccionar de uno de los siguientes algoritmos

source: Also, it is possible to save and load a trained classifier.
es_419: También es posible guardar y cargar un clasificador previamente entrenado.

source: Input
es_419: Entrada

source: Tool symbol and name
es_419: Símbolo de la herramienta y nombre

source: Description
es_419: Descripción

source: :guilabel:`Select input band set` |input_number|
es_419: :guilabel:`Seleccionar el conjunto de bandas de entrada` |input_number|

source: input_number
es_419: número de entrada

source: select the input :ref:`band_set_tab` to be classified
es_419: selecciona el :ref:`band_set_tab` a clasificar

source: |checkbox| :guilabel:`Use input normalization` |optional|
es_419: |checkbox| :guilabel:`Usar normalización de datos de entrada` |optional|

source: checkbox
es_419: casilla de confirmación

source: optional
es_419: opcional

source: if checked, normalize the input based on the selected method
es_419: si está marcado, normaliza los datos de entrada usando uno de los métodos seleccionados

source: radiobutton
es_419: botón de radio

source: if checked with |checkbox| :guilabel:`Use input normalized`, Z-score normalization of input is performed
es_419: si está marcado con |checkbox| :guilabel:`Usar entrada normalizada`,se realizará la normalización de los datos de entrada usando Z-score.

source: |radiobutton| :guilabel:`Linear scaling`
es_419: |radiobutton| :guilabel:`Escalado lineal`

source: if checked with |checkbox| :guilabel:`Use input normalized`, Linear scaling normalization of input is performed
es_419: si está marcado con |checkbox| :guilabel:`Usar entrada normalizada`,se realizará la normalización de los datos de entrada usando reescalado lineal.

source: :guilabel:`Use training` |radiobutton| :guilabel:`Macroclass ID`
es_419: :guilabel:`Usar entrenamiento con` |radiobutton| :guilabel:`ID de Macroclase`

source: if checked, the classification is performed using
es_419: si está marcado la clasificación se realizará usando

source: :guilabel:`Use training` |radiobutton| :guilabel:`Class ID` the Macroclass ID (code `MC ID` of the signature)
es_419: :guilabel:`usar entrenamiento con` |radiobutton| :guilabel:`ID de Clase` la ID de Macroclase (código `MC ID` de la firma)

source: if checked, the classification is performed using the Class ID (code `C ID` of the signature)
es_419: si está marcado, la clasificación se realizará usando el ID de Clase (código `C ID` de la firma)

source: Algorithm
es_419: Algoritmo

source: This tool allows for the selection of the classification algorithm. The algorithm tab includes the available parameters.
es_419: Esta herramienta permite seleccionar del algoritmo de clasificación. La pestaña de algoritmo incluye los parámetros disponibles.

source: Maximum Likelihood
es_419: Máxima Probabilidad

source: :guilabel:`Maximum Likelihood`
es_419: :guilabel:`Máxima Probabilidad`

source: Use the :ref:`max_likelihood_algorithm` algorithm.
es_419: Usar el algoritmo de :ref:`max_likelihood_algorithm`.

source: :guilabel:`Use single threshold` |input_number| |optional|
es_419: :guilabel:`Usar un único umbral` |input_number| |optional|

source: if checked, it allows for the definition of a classification threshold (applied to all the spectral signatures); pixels are unclassified if probability is less than threshold value (max 100)
es_419: si está marcado, permite definir el umbral de clasificación (aplicado a todas las firmas espectrales), los píxeles quedaran sin clasificar si la probabilidad es mejor que valor umbral (max. 100)

source: :guilabel:`Signature threshold` |input_number| |optional|
es_419: :guilabel:`Umbral de las firmas` |input_number| |optional|

source: if checked, thresholds :ref:`Signature_threshold_tab` are evaluated
es_419: si está marcado, los umbrales :ref:`Signature_threshold_tab` son evaluados

source: threshold_tool
es_419: herramienta de umbral

source: open the :ref:`Signature_threshold_tab` for the definition of signature thresholds
es_419: abre la :ref:`Signature_threshold_tab` para definir los umbrales para las firmas

source: |checkbox| :guilabel:`Save signature raster` |optional|
es_419: |checkbox| :guilabel:`Guarda el ráster de firmas` |optional|

source: if checked, in addition to the classification raster, for each spectral signature a raster is saved in the same output directory, which represents the distance between pixel and signature
es_419: si está marcado, además del ráster de la clasificación, se generara un ráster para cada firma espectral en el mismo directorio de salida, el cual representa la distancia entre los valores espectrales de un pixel y la firma.

source: |checkbox| :guilabel:`Calculate classification confidence raster` |optional|
es_419: |checkbox| :guilabel:`Calcular ráster de confiabilidad de la clasificacion` |optional|

source: if checked, calculate classification confidence raster
es_419: si está marcado, se calculará el ráster de confiabilidad de la clasificación

source: Minimum Distance
es_419: Distancia mínima

source: :guilabel:`Minimum Distance`
es_419: :guilabel:`Distancia Mínima`

source: Use the :ref:`minimum_distance_algorithm` algorithm.
es_419: Usa el algoritmo de :ref:`minimum_distance_algorithm`.

source: if checked, it allows for the definition of a classification threshold (applied to all the spectral signatures); pixels are unclassified if distance is greater than threshold value
es_419: si está marcado, permite la definición de un umbral de clasificación (aplicado a todas las firmas espectrales), los píxeles no serán clasificados si la distancia es mayor al valor umbra

source: Multi-layer Perceptron
es_419: Perceptron Mutli-capa

source: :guilabel:`Multi-layer Perceptron`
es_419: :guilabel:`Perceptron Multi-capa`

source: Use the :ref:`multi_layer_perceptron_algorithm` algorithm.
es_419: Usa el algoritmo de :ref:`multi_layer_perceptron_algorithm`.

source: :guilabel:`Use framework` |radiobutton| :guilabel:`scikit-learn`
es_419: :guilabel:`Usa el framework de` |radiobutton| :guilabel:`scikit-learn`

source: if checked, use scikit-learn framework (read `this <https://remotior-sensus.readthedocs.io/en/latest/remotior_sensus.tools.band_classification.html>`_)
es_419: si está marcado, usar el framework de scikit-learn (lee `esto <https://remotior-sensus.readthedocs.io/en/latest/remotior_sensus.tools.band_classification.html>`_)

source: :guilabel:`Use framework` |radiobutton| :guilabel:`PyTorch`
es_419: :guilabel:`Usa el framework` |radiobutton| :guilabel:`PyTorch`

source: if checked, use PyTorch framework (read `about this <https://remotior-sensus.readthedocs.io/en/latest/remotior_sensus.tools.band_classification.html>`_)
es_419: si está marcado, se usa el framework PyTorch (lee `estos <https://remotior-sensus.readthedocs.io/en/latest/remotior_sensus.tools.band_classification.html>`_)

source: :guilabel:`Hidden layer sizes` |input_number|
es_419: :guilabel:`Tamaño de capas ocultas` |input_number|

source: list of values separated by comma, where each value defines the number of neurons in a hidden layer (e.g.: 200, 100 for two hidden layers of 200 and 100 neurons respectively)
es_419: lista de valores separados por comas, en la que cada valor define el número de neuronas en una capa oculta (e.g.: 200, 100 for two hidden layers of 200 and 100 neurons respectively)

source: :guilabel:`Max iter` |input_number|
es_419: :guilabel:`Iter. Max.` |input_number|

source: set the maximum number of iterations
es_419: define el número máximo de iteraciones

source: :guilabel:`Activation` |input_text|
es_419: :guilabel:`Activación` |input_text|

source: input_text
es_419: texto de entrada

source: set the activation function (default: relu)
es_419: define la función de activación (por defecto: relu)

source: set the weight decay (also L2 regularization term) for Adam optimizer
es_419: define el decaimiento de pesos (también el término de regularización L2) para el optimizador Adam

source: :guilabel:`Training proportion` |input_number|
es_419: :guilabel:`Proporción de entrenamiento` |input_number|

source: set the proportion of data to be used as training and the remaining part as test
es_419: define la proporción de los datos que serán utilizados para entrenamiento, el resto será el conjunto de datos para prueba

source: :guilabel:`Batch size` |input_text|
es_419: :guilabel:`Tamaño del Batch` |input_text|

source: set the number of samples per batch for optimizer; if auto, the batch is the minimum value between 200 and the number of samples
es_419: define el número de muestra por lote para el optimizador, si se deja por defecto, el tamaño será el mínimo entre 200 o el número de muestras

source: :guilabel:`Learning rate init` |input_number|
es_419: :guilabel:`Tasa de aprendizaje inicial` |input_number|

source: set initial learning rate
es_419: define la tasa de aprendizaje inicial

source: |checkbox| :guilabel:`Cross validation` |optional|
es_419: |checkbox| :guilabel:`Validación cruzada` |optional|

source: if checked, perform cross validation
es_419: si está marcado, se llevará acabo una validación cruzada

source: |checkbox| :guilabel:`Find best estimator with steps` |optional|
es_419: |checkbox| :guilabel:`Encontrar el mejor estimador en pasos` |optional|

source: if checked, find the best estimator iteratively with a number of steps
es_419: si está marcado, eneuntra el mejor estimador iterativamente usando un número de pasos

source: Random Forest
es_419: Bosque Aleatorio

source: :guilabel:`Random Forest`
es_419: :guilabel:`Bosque aleatorio

source: Use the :ref:`random_forest_definition` algorithm.
es_419: Usar el algoritmo :ref:`random_forest_definition`

source: :guilabel:`Number of trees` |input_number|
es_419: :guilabel:`Número de árboles` |input_number|

source: set the number of trees
es_419: define el número de árboles

source: set the minimum number of samples required to split an internal node
es_419: define el número mínimo de muestras requerido para dividir un nodo interno

source: :guilabel:`Max features` |input_number| |optional|
es_419: :guilabel:`Objetos máximos` |input_number| |optional|

source: for node splitting, if empty all features are considered; if sqrt the square root of all the features, if integer number the number of features; if float number a fraction of all the features
es_419: para la división de nodos, si está vacío se consideran todos los objetos; si es sqrt la raíz cuadrada de de todos los objetos, si es integer el número entero de objetos; si es un número decimal la fracción correspondiente de objetos

source: |checkbox| :guilabel:`One-Vs-Rest` |optional|
es_419: |checkbox| :guilabel:`Uno-Vs-Resto` |optional|

source: if checked, perform One-Vs-Rest classification (read `more <https://scikit-learn.org/stable/modules/generated/sklearn.multiclass.OneVsRestClassifier.html>`_)
es_419: si está marcado, realizar una clasificación Uno-Vs-Resto (leer `mas <https://scikit-learn.org/stable/modules/generated/sklearn.multiclass.OneVsRestClassifier.html>`_)

source: |checkbox| :guilabel:`Balanced class weight` |optional|
es_419: |checkbox| :guilabel:`Balanceo de pesos de clases` |optional|

source: if checked, balanced weight is computed inversely proportional to class frequency
es_419: si está marcado, se calcula un peso balanceado siendo inversamente proporcional a la frecuencia de las clases

source: Spectral Angle Mapping
es_419: Mapeo del Angulo Espectral

source: :guilabel:`Spectral Angle Mapping`
es_419: :guilabel:`Mapeo de Angulo Espectral`

source: Use the :ref:`spectra_angle_mapping_algorithm` algorithm.
es_419: Usa el algoritmo de :ref:`spectra_angle_mapping_algorithm`.

source: if checked, it allows for the definition of a classification threshold (applied to all the spectral signatures); pixels are unclassified if spectral angle distance is greater than threshold value (max 90)
es_419: si está marcado, permite definir el umbral para la clasificación (aplicado a las firmas espectrales); los píxeles no son clasificados si la distancia angular espectral es superior al umbra (máx. 90)

source: Support Vector Machine
es_419: Máquinas de Soporte de Vectores

source: :guilabel:`Support Vector Machine`
es_419: :guilabel:`Máquinas de Soporte de Vectores`

source: Use the :ref:`support_vector_machine_definition` algorithm.
es_419: Usa el algoritmo de :ref:`support_vector_machine_definition`.

source: :guilabel:`Regularization parameter C` |input_number|
es_419: :guilabel:`Parámetro de Regularización C` |input_number|

source: set the regularization parameter C
es_419: define el parámetro de regularización C

source: set the kernel (default: rbf)
es_419: define el kernel (por defecto: rbf)

source: set the kernel coefficient gamma (default: scale)
es_419: define el coeficiente gamma del kernel (por defecto: escala)

source: Run
es_419: Ejecutar

source: It is possible to run the classification, or save and load a trained classifier.
es_419: Es posible correr la clasificación, o guardar y cargar un clasificador entrenado

source: Classification raster is a file ``.tif`` (a QGIS style file ``.qml`` is saved along with the classification); also other outputs can be optionally calculated. Outputs are loaded in QGIS after the calculation.
es_419: El ráster de clasificación es un archivo `` .tif '' (un archivo de estilo QGIS `` .qml '' se guarda junto con la clasificación); también se pueden calcular opcionalmente otras salidas. Las salidas se cargan en QGIS después del cálculo.

source: :guilabel:`Load classifier` |open_file|
es_419: :guilabel:`Cargar clasificador` |open_file|

source: open_file
es_419: abrir archivo

source: open an already save classifier file (.rsmo)
es_419: abrir un archivo de clasificador previamente guardado (.rsmo)

source: :guilabel:`Save classifier` |export|
es_419: :guilabel:`Guardar clasificador` |export|

source: export
es_419: exportar

source: save the classifier to file (.rsmo), in order to be loaded later
es_419: guardar el clasificador en un archivo (.rsmo), para que luego pueda ser cargado

source: :guilabel:`RUN` |run|
es_419: :guilabel:`EJECUTAR` |run|

source: run
es_419: ejecutar

source: run this function
es_419: ejecutar esta función
