Repository: semiautomaticgit/SemiAutomaticClassificationManual
Catalog: locale/*/LC_MESSAGES/clip_raster_bands_tab.po
Languages: es_es

source: Clip raster bands
es_es: Recortar bandas ráster

source: :guilabel:`Clip multiple rasters`
es_es: :guilabel:`Recortar varios rásteres`

source: This tab allows for cutting several image bands at once, using a rectangle defined with point coordinates or a boundary defined with a vector.
es_es: Esta pestaña permite cortar varias bandas de la imagen a la vez, utilizando un rectángulo definido con coordenadas de puntos o un límite definido con un vector.

source: Information about APIs of this tool in Remotior Sensus at this `link <https://remotior-sensus.readthedocs.io/en/latest/remotior_sensus.tools.band_clip.html>`_ .
es_es: Información sobre las APIs de esta herramienta de Remotior Sensus en este `enlace <https://remotior-sensus.readthedocs.io/en/latest/remotior_sensus.tools.band_clip.html>`_ .

source: Clip band set
es_es: Recortar conjunto de bandas

source: Tool symbol and name
es_es: Símbolo y nombre de la herramienta

source: Description
es_es: Descripción

source: :guilabel:`Select input band set` |input_number|
es_es: :guilabel:`Seleccionar el conjunto de bandas de entrada` |input_number|

source: select the input :ref:`band_set_tab` to be clipped
es_es: selecciona el :ref:`band_set_tab` a recortar

source: |checkbox| :guilabel:`Use value as NoData` |input_number|
es_es: |checkbox| :guilabel:`Usar el valor como Sin Datos` |input_number|

source: if checked, set the value for ``NoData`` pixels (e.g. pixels outside the clipped area)
es_es: si está marcado, define el valor para los píxeles `Sin datos` (e.g. píxeles fuera del area recortada)

source: :guilabel:`Output name prefix` |input_text|
es_es: :guilabel:`Prefijo del nombre del archivo de salida` |input_text|

source: set the prefix for output file names (default is ``clip``)
es_es: define el prefijo de los archivos de salida (por defecto es ``clip``)

source: Clip coordinates
es_es: Coordenadas de recorte

source: Set the Upper Left (UL) and Lower Right (LR) point coordinates of the rectangle used for clipping; it is possible to enter the coordinates manually. Alternatively use a vector.
es_es: Define las coordenadas de los puntos superior izquierdo (SI) e inferior derecho (ID) del rectángulo utilizado para el recorte; Es posible ingresar las coordenadas manualmente. Como alternativa, usa un vector.

source: |radiobutton| :guilabel:`Use coordinates for clipping`
es_es: |radiobutton| :guilabel:`Usar coordenadas para el recorte`

source: if checked, use defined coordinates for clipping bands
es_es: si está marcado, se usaran las coordenadas para recortar las bandas

source: :guilabel:`UL X` |input_number|
es_es: :guilabel:`X SI` |input_number|

source: set the UL X coordinate
es_es: define la coordenada X de la esquina SI

source: :guilabel:`UL Y` |input_number|
es_es: :guilabel:`Y SI` |input_number|

source: set the UL Y coordinate
es_es: define la coordenada Y de la esquina SI

source: :guilabel:`LR X` |input_number|
es_es: :guilabel:`X ID` |input_number|

source: set the LR X coordinate
es_es: define la coordenada X de la esquina ID

source: :guilabel:`LR Y` |input_number|
es_es: :guilabel:`Y ID` |input_number|

source: set the LR Y coordinate
es_es: define la coordenada Y de la esquina ID

source: |radiobutton| :guilabel:`Show`
es_es: |radiobutton| :guilabel:`Mostrar`

source: show or hide the clip area drawn in the map
es_es: mostrar o ocultar el área de recorte en el mapa

source: define a clip area by drawing a rectangle in the map; left click to set the UL point and right click to set the LR point; the area is displayed in the map
es_es: define el área de recorte dibujándola en el mapa; click izquierdo para definir la esquina SI y click derecho para definir la esquina ID; el área se muestra en el mapa

source: |radiobutton| :guilabel:`Use vector for clipping` |input_list|
es_es: |radiobutton| :guilabel:`Usar un vector para recortar` |input_list|

source: if checked, use the selected vector (already loaded in QGIS) for clipping; UL and LR coordinates are ignored
es_es: si está marcada, usar el vector seleccionado (ya cargado en QGIS) para recortar; las coordenadas SI e ID serán ignoradas

source: |checkbox| :guilabel:`Use vector field for output name` |input_list|
es_es: |checkbox| :guilabel:`Usar un campo del vector para el nombre de salida` |input_list|

source: if checked, a vector field is selected for clipping while iterating through each vector polygon and the corresponding field value is added to the output name
es_es: si está marcado, se selecciona un campo del vector para iterar sobre cada polígono y el valor del campo correspondiente es añadido al nombre de salida

source: |radiobutton| :guilabel:`Use temporary ROI for clipping`
es_es: |radiobutton| :guilabel:`Usar una RDI temporal para recortar`

source: if checked, use a :ref:`temporary_ROI` for clipping; UL and LR coordinates are ignored
es_es: si está marcado, usar una :ref:`temporary_ROI` para recortar; las coordenadas SI e ID serán ignoradas

source: refresh layer list
es_es: actualizar la lista de capas

source: add this function to the :ref:`script_tab`
es_es: añadir está función al :ref:`script_tab`

source: :guilabel:`RUN` |run|
es_es: :guilabel:`EJECUTAR` |run|

source: run this function
es_es: ejecutar esta función
