Repository: semiautomaticgit/SemiAutomaticClassificationManual
Catalog: locale/*/LC_MESSAGES/debug_tab.po
Languages: es_es

source: Debug
es_es: Depuración

source: :guilabel:`Debug`
es_es: :guilabel:`Depuración`

source: This tab allows for the debug of :guilabel:`SCP` in case of issues, and the check of :guilabel:`SCP` dependencies.
es_es: Esta pestaña permite depurar :guilabel:`SCP` en el caso de que haya problemas, y verificar las dependencias de :guilabel:`SCP`

source: Log file
es_es: Archivo de Registro

source: Tool symbol and name
es_es: Símbolo y nombre de la herramienta

source: Description
es_es: Descripción

source: :guilabel:`Record detailed events in a Log file` |registry_save|
es_es: :guilabel:`Registrar eventos en un archivo de registro` |registry_save|

source: if checked, start recording detailed events in a Log file
es_es: si está marcado, se grabaran eventos detallados en un archivo de registro.

source: export the Log file to a .txt file
es_es: exportar el registro a un archivo .txt

source: Test
es_es: Prueba

source: :guilabel:`Test dependencies` |enter|
es_es: :guilabel:`Probar dependencias` |enter|

source: test :guilabel:`SCP` dependencies (NumPy, SciPy, Matplotlib, GDAL, PyTorch, scikit-learn, Remotior Sensus, Multiprocess, Internet connection)
es_es: test :guilabel:Dependencias de `SCP` (NumPy, SciPy, Matplotlib, GDAL, PyTorch, scikit-learn, Remotior Sensus, Multiprocess, conexión a internet)
