Repository: semiautomaticgit/SemiAutomaticClassificationManual
Catalog: locale/*/LC_MESSAGES/export_signatures_tab.po
Languages: es_mx

source: Export signatures
es_mx: Exportar firmas

source: |export_spectral_library| :guilabel:`Export signatures`
es_mx: |export_spectral_library| :guilabel:`Exportar firmas`

source: This tool allows for exporting the signatures highlighted in the :ref:`ROI_list`.
es_mx: Esta herramienta permite exportar las firmas seleccionadas en el :ref:`ROI_list`.

source: Tool symbol and name
es_mx: Símbolo de la herramienta y nombre

source: Description
es_mx: Descripción

source: :guilabel:`Export as SCP file` |new_file|
es_mx: :guilabel:`Exportar como un archivo SCP` |new_file|

source: new_file
es_mx: nuevo archivo

source: create a new .scp file and export highlighted ROIs and spectral signatures as :guilabel:`SCP` file (.scpx)
es_mx: crea un archivo .scp nuevo y exportar las ROIs seleccionadas y las firmas espectrales como un archivo :guilabel:`SCP` (.scpx)

source: :guilabel:`Export as shapefile or geopackage` |new_file|
es_mx: :guilabel:`Exportar a shapefile o geopackage` |new_file|

source: export highlighted ROIs (spectral signature data excluded) as a new shapefile (.shp) or geopackage (.gpkg)
es_mx: exportar las ROIs seleccionadas (sin los datos de las firmas espectrales) a shapefile (.shp) o geopackage (.gpkg)

source: :guilabel:`Export spectral signatures as CSV file` |open_dir|
es_mx: :guilabel:`Exportar las firmas espectrales a un achivo CSV` |open_dir|

source: open_dir
es_mx: abrir_dir

source: open a directory, and export highlighted spectral signatures as individual CSV files (.csv) separated by semicolon ( ; )
es_mx: abre un directorio, y exportar las firmas espectrales seleccionadas a archivos CSV individuales (.csv) separa por punto y coma ( ; )
